tests/performance/load-test.yml
config:
  target: "http://localhost:8001"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Warm up"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  ensure:
    p95: 500
    maxErrorRate: 2
  apdex:
    threshold: 100
  defaults:
    headers:
      Content-Type: "application/json"
      X-API-Key: "dev-master-key"
  variables:
    agentId:
      - "test-agent-id"

scenarios:
  - name: "Task Submission Flow"
    weight: 7
    flow:
      - post:
          url: "/v1/chat/completions"
          json:
            model: "gpt-4o"
            messages:
              - role: "user"
                content: "Print Hello World"
          capture:
            - json: "$.id"
              as: "taskId"
          expect:
            - statusCode: 200

  - name: "Status Query Flow"
    weight: 2
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Orchestrator Lock Test"
    weight: 1
    flow:
      - post:
          url: "/v1/agents/terminate"
          json:
            agent_id: "{{ agentId }}"
          expect:
            - statusCode: 404 # Expecting 404 since ID is fake, but server must handle it (not 500)